code-review/NRB_3471_3546/База_Стало/Enums/ФормыСообщенийКК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ФормыСообщенийКК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AddClientToCorporateActionWtrc</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CreateCorporateActionTrec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CreateCorporateActionWtrc</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SendEmailToClients</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбИзмененииОстатковЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбИтогахСобрания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбОтменеКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбОтменеСобрания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПоступленииИнформацииИзБюллетеня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПоступленииМатериаловКОбщемуСобраниюВладельцев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПроведенииКД_CвязанногоСВыплатой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПроведенииКД_CвязанногоСВыплатой_INTR_PRII</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПроведенииКД_CвязанногоСВыплатой_PRED_REDM_MCAL_others</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПроведенииКД_CписаниеЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПроведенииКД_ВозвратЧастиНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПроведенииКД_ВыкупПриобретениеЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПроведенииКД_КонвертацияОбменЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПроведенииКД_ОбъединениеВыпусковЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПроведенииКД_ПодтверждениеОсвобожденияОтНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПроведенииКД_ПодтверждениеОсвобожденияОтНалогаПоЦБНеПодпадающимПодНалоговоеРегулированиеСША</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПроведенииКД_ПрочихВидов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПроведенииКД_РаскрытиеИнформации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПроведенииКД_РеорганизацииОбщества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПроведенииКД_СущественноеИзменениеПоЦБИноеСобытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвободнаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПроведенииКД_ВозвратЧастиНалогаНДИНД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросСубброкеруНаРаскрытиеДобровольное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросСубброкеруНаРаскрытиеОбязательное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПроведенииКД_BPUT</Name>
					<Comment>Досрочное погашение облигаций по требованию владельца</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПроведенииКД_BIDS_TEND</Name>
					<Comment>BIDS - Оферта /предложение Эмитента о выкупе ценных бумаг; TEND - Тендерное предложение о выкупе /обратный выкуп.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПроведенииКД_PRIO</Name>
					<Comment>Преимущественное право приобретения ценных бумаг (ст. 40 ФЗ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОРегистрацииЗаявкиВУКПаи</Name>
					<Comment>Уведомление о регистрации заявки в УК (паи)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ФормыСообщенийКК/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает булево о том, является ли переданная форма одной из
// ОПроведенииКД_CвязанногоСВыплатой, ОПроведенииКД_CвязанногоСВыплатой_PRED_REDM_MCAL_others,
// или ОПроведенииКД_CвязанногоСВыплатой_INTR_PRII
// Параметры:
//  ФормаСообщенияКК - Перечисления.ФормыСообщенийКК - Форма сообщения кабинета клиента
// Возвращаемое значение:
//  Булево - результат проверки
Функция ЭтоФормаСвязаннаяСВыплатой(ФормаСообщенияКК) Экспорт

	Возврат ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_CвязанногоСВыплатой
		Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_CвязанногоСВыплатой_PRED_REDM_MCAL_others
		Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_CвязанногоСВыплатой_INTR_PRII;

КонецФункции

// Возвращает булево о том, является ли переданная форма одной из связанных с выкупом или приобретением ЦБ:
// ОПроведенииКД_BPUT, ОПроведенииКД_BIDS_TEND, ОПроведенииКД_PRIO или ОПроведенииКД_ВыкупПриобретениеЦБ
// Параметры:
//  ФормаСообщенияКК - Перечисления.ФормыСообщенийКК - Форма сообщения кабинета клиента
// Возвращаемое значение:
//  Булево - результат проверки
Функция ЭтоФормаСвязаннаяСВыкупомИлиПриобретениемЦБ(ФормаСообщенияКК) Экспорт

	Возврат ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_BPUT
		Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_BIDS_TEND
		Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_PRIO
		Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВыкупПриобретениеЦБ;

КонецФункции

// Возвращает булево о том, является ли переданная форма одной из связанных с возвратом части налога:
// ОПроведенииКД_ВозвратЧастиНалога Или ОПроведенииКД_ВозвратЧастиНалогаНДИНД.
// Параметры:
//  ФормаСообщенияКК - Перечисления.ФормыСообщенийКК - Форма сообщения кабинета клиента
// Возвращаемое значение:
//  Булево - результат проверки
Функция ЭтоФормаСвязаннаяСВозвратомЧастиНалога(ФормаСообщенияКК) Экспорт
	
	Возврат ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВозвратЧастиНалога
		Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВозвратЧастиНалогаНДИНД;
	
КонецФункции

// Возвращает булево о том, является ли переданная форма одной из связанных с подтверждением
// освобождения от налога: CreateCorporateActionTrec или CreateCorporateActionWtrc.
// Параметры:
//  ФормаСообщенияКК - Перечисления.ФормыСообщенийКК - Форма сообщения кабинета клиента
// Возвращаемое значение:
//  Булево - результат проверки
Функция ЭтоФормаСвязаннаяСПодтверждениемОсвобожденияОтНалога(ФормаСообщенияКК) Экспорт
	
	Возврат ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.CreateCorporateActionTrec
		Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.CreateCorporateActionWtrc;
	
КонецФункции


#КонецОбласти
